@echo off
CHCP 65001 >nul
color A
set /P n=Введите диск C/D:
dir %n%:/A:D/B
echo -----------------------------------------------------------

set /P w=поиск расширений(poisk) или продолжить выбор каталога(pyt):
if %w%==poisk goto poisk


set /P b=Введите каталог (\katalog\):
dir %n%:%b%/B
echo -----------------------------------------------------------

set /P w=поиск расширений(poisk) или продолжить выбор каталога(pyt):
if %w%==poisk goto poisk

set /P c=Введите каталог (katalog\):
dir %n%:%b%%c%/B
echo -----------------------------------------------------------

set /P w=поиск расширений(poisk) или продолжить выбор каталога(pyt):
if %w%==poisk goto poisk

set /P h=Введите каталог (katalog\):
dir %n%:%b%%c%%h%/B
echo -----------------------------------------------------------

set /P w=поиск расширений(poisk) или продолжить выбор каталога(pyt):
if %w%==poisk goto poisk

set /P k=Введите каталог (katalog\):
dir %n%:%b%%c%%h%%k%/B
echo -----------------------------------------------------------

set /P w=поиск расширений(poisk) или продолжить выбор каталога(pyt):
if %w%==poisk goto poisk

:poisk
set /p z=Введите расширение:
dir %n%:%b%%c%%h%%k%*.%z%/B

 
for %%f   in (%n%:%b%%c%%h%%k%*.%z%) do set /a i+=1 & echo %%f 
echo Каталог %n%:%b%%c%%h%%k% содержит %i% файлов с .%z% расширением>>lab2.txt

echo -----------------------------------------------------------

pause